---
kind: type
id: T:Autodesk.Revit.DB.RowHeightOverrideOptions
source: html/3f75752e-c4df-90c9-e296-ac604f8c4fd9.htm
---
# Autodesk.Revit.DB.RowHeightOverrideOptions

Describes the options for overriding schedule body row heights (applied when viewed as a ScheduleSheetInstance on a ViewSheet).

## Syntax (C#)
```csharp
public enum RowHeightOverrideOptions
```